#+NAME: Set Quotients
#+AUTHOR: Johann Rosain

** Uniqueness principle
We show that whenever a pair (f : A \to B, g : R(x, y) \to f x = f y) is a set quotient, then any map that extends f is unique. To see this, we use the im/inclusion and im/q functions. First, we show that for any x, y such that R(x, y), im/q q x = im/q q y. Indeed, im/inclusion (im/q q x) = q x = q y = im/inclusion (im/q q y), and im/inclusion is injective.
#+begin_src ctt
  is-set-quotient/is-surj/identifying-q (A : U) (R : Eq-Rel A) (B : UU-Set) (f : reflecting-map-Eq-Rel A R (Set/type B))
                                        (x y : A) (r : Eq-Rel/type A R x y)
                                           : Path (im A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f))
                                                  (im/q A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f) x)
                                                  (im/q A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f) y) =
    let g : A -> Set/type B = (reflecting-map-Eq-Rel/map A R (Set/type B) f) in
    im/is-injective A
      ( Set/type B) g
      ( im/q A (Set/type B) g x)
      ( im/q A (Set/type B) g y)
      ( comp-n
        ( Set/type B) three-Nat
        ( im/inclusion A (Set/type B) g (im/q A (Set/type B) g x))
        ( g x)
        ( im/htpy A (Set/type B) g x)
        ( g y)
        ( reflecting-map-Eq-Rel/reflects-Eq A R (Set/type B) f x y r)
        ( im/inclusion A (Set/type B) g (im/q A (Set/type B) g y))
        ( im/htpy' A (Set/type B) g y))
#+end_src
As im(q) is a set and f a set quotient, we get an extension of q_q along q.
#+begin_src ctt
  is-set-quotient/is-surj/map (A : U) (R : Eq-Rel A) (B : UU-Set) (f : reflecting-map-Eq-Rel A R (Set/type B))
                              (is-set-quotient-f : is-set-quotient A R B f) : Set/type B -> im A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f) =
    let q : A -> Set/type B = reflecting-map-Eq-Rel/map A R (Set/type B) f in
    is-equiv/inv-map
      ( Set/type B -> im A (Set/type B) q)
      ( reflecting-map-Eq-Rel A R (Set/type (im/Set A B q)))
      ( precomp-Set-quotient A R B (im/Set A B q) f)
      ( is-set-quotient-f (im/Set A B q))
      ( im/q A (Set/type B) q,
        is-set-quotient/is-surj/identifying-q A R B f)
#+end_src
We can show that the composition of this map with image inclusion is actually q_q.
#+begin_src ctt
  lock is-prop/is-set
  is-set-quotient/is-surj/htpy (A : U) (R : Eq-Rel A) (B : UU-Set) (f : reflecting-map-Eq-Rel A R (Set/type B))
                               (H : is-set-quotient A R B f) : Htpy' A (im A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f))
                                                                     (\ x. is-set-quotient/is-surj/map A R B f H (reflecting-map-Eq-Rel/map A R (Set/type B) f x))
                                                                     (im/q A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f)) =
    let q : A -> Set/type B = reflecting-map-Eq-Rel/map A R (Set/type B) f in
    htpy-eq' A
      ( im A (Set/type B) q)
      ( \ x. is-set-quotient/is-surj/map A R B f H (q x))
      ( im/q A (Set/type B) q)
      ( \ i. ( ( is-equiv/inv-right-htpy 
                ( Set/type B -> im A (Set/type B) q)
                ( reflecting-map-Eq-Rel A R (Set/type (im/Set A B q)))
                ( precomp-Set-quotient A R B (im/Set A B q) f)
                ( H (im/Set A B q))
                ( im/q A (Set/type B) q,
                  is-set-quotient/is-surj/identifying-q A R B f)) i).1)
#+end_src
As such, the composition of the inclusion with the map and q is q.
#+begin_src ctt
  is-set-quotient/is-surj/htpy2 (A : U) (R : Eq-Rel A) (B : UU-Set) (f : reflecting-map-Eq-Rel A R (Set/type B)) (H : is-set-quotient A R B f) (x : A)
                                   : Path (Set/type B)
                                          (im/inclusion A (Set/type B) (reflecting-map-Eq-Rel/map A R (Set/type B) f)
                                                          (is-set-quotient/is-surj/map A R B f H (reflecting-map-Eq-Rel/map A R (Set/type B) f x)))
                                          (reflecting-map-Eq-Rel/map A R (Set/type B) f x) =
    let q : A -> Set/type B = reflecting-map-Eq-Rel/map A R (Set/type B) f in
    comp
      ( Set/type B)
      ( im/inclusion A
        ( Set/type B) q
        ( is-set-quotient/is-surj/map A R B f H (q x)))
      ( im/inclusion A
        ( Set/type B) q
        ( im/q A (Set/type B) q x))
      ( ap (im A (Set/type B) q) (Set/type B) (im/inclusion A (Set/type B) q) (is-set-quotient/is-surj/map A R B f H (q x)) (im/q A (Set/type B) q x)
        ( is-set-quotient/is-surj/htpy A R B f H x))
      ( q x)
      ( im/htpy A (Set/type B) q x)
#+end_src
We can conclude that q is surjective.
#+begin_src ctt
  -- is-set-quotient/is-surj (A : U) (R : Relation-Prop A) (B : UU-Set) (f : reflecting-map-Eq-Rel A R B) (H : is-set-quotient A R B f)
  --                            : is-surj A (Set/type B) (reflecting-map-Eq-Rel A R B f) =
  --   let q : A -> Set/type B = (reflecting-map-Eq-Rel A R B f) in
#+end_src

#+RESULTS:
: Typecheck has succeeded.

